fixtures/payable-route.json

{
  "name": "Payable route",
  "description": "A healthy Fiber node with a dry-run route to the invoice payee.",
  "input": {
    "invoice": "fibt1payableroute",
    "amount": "0x186a0"
  },
  "calls": {
    "node_info": {
      "result": {
        "version": "0.8.1",
        "commit_hash": "demo",
        "pubkey": "02aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa",
        "features": ["announcement", "basic_mpp"],
        "node_name": "preflight-demo-node",
        "addresses": ["/ip4/127.0.0.1/tcp/8228"],
        "chain_hash": "0x1111111111111111111111111111111111111111111111111111111111111111",
        "channel_count": "0x2",
        "pending_channel_count": "0x0",
        "peers_count": "0x2",
        "udt_cfg_infos": []
      }
    },
    "list_peers": {
      "result": {
        "peers": [
          {
            "pubkey": "02bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
            "address": "/ip4/127.0.0.1/tcp/8230"
          },
          {
            "pubkey": "02cccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccc",
            "address": "/ip4/127.0.0.1/tcp/8231"
          }
        ]
      }
    },
    "list_channels": {
      "result": {
        "channels": [
          {
            "channel_id": "0xaaaa",
            "is_public": true,
            "is_acceptor": false,
            "is_one_way": false,
            "channel_outpoint": "0xaaaa0001",
            "pubkey": "02bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
            "funding_udt_type_script": null,
            "state": {
              "state_name": "ChannelReady"
            },
            "local_balance": "0x5f5e100",
            "offered_tlc_balance": "0x0",
            "remote_balance": "0x2faf080",
            "received_tlc_balance": "0x0",
            "pending_tlcs": [],
            "enabled": true,
            "tlc_expiry_delta": "0x5265c00",
            "tlc_fee_proportional_millionths": "0x3e8",
            "failure_detail": null
          },
          {
            "channel_id": "0xbbbb",
            "is_public": true,
            "is_acceptor": false,
            "is_one_way": false,
            "channel_outpoint": "0xbbbb0001",
            "pubkey": "02cccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccc",
            "funding_udt_type_script": null,
            "state": {
              "state_name": "ChannelReady"
            },
            "local_balance": "0x2faf080",
            "offered_tlc_balance": "0x0",
            "remote_balance": "0x2faf080",
            "received_tlc_balance": "0x0",
            "pending_tlcs": [],
            "enabled": true,
            "tlc_expiry_delta": "0x5265c00",
            "tlc_fee_proportional_millionths": "0x3e8",
            "failure_detail": null
          }
        ]
      }
    },
    "graph_nodes": {
      "result": {
        "nodes": [
          {
            "pubkey": "02aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa",
            "node_name": "payer",
            "features": ["announcement", "basic_mpp"],
            "addresses": []
          },
          {
            "pubkey": "02bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
            "node_name": "relay-a",
            "features": ["announcement"],
            "addresses": []
          },
          {
            "pubkey": "02dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd",
            "node_name": "merchant",
            "features": ["announcement", "basic_mpp"],
            "addresses": []
          }
        ],
        "last_cursor": "0x"
      }
    },
    "graph_channels": {
      "result": {
        "channels": [
          {
            "channel_outpoint": "0xaaaa0001",
            "node1": "02aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa",
            "node2": "02bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
            "capacity": "0x8f0d180",
            "udt_type_script": null,
            "update_info_of_node1": {
              "timestamp": "0x1",
              "enabled": true,
              "outbound_liquidity": "0x5f5e100",
              "tlc_expiry_delta": "0x5265c00",
              "tlc_minimum_value": "0x1",
              "fee_rate": "0x3e8"
            },
            "update_info_of_node2": {
              "timestamp": "0x1",
              "enabled": true,
              "outbound_liquidity": "0x2faf080",
              "tlc_expiry_delta": "0x5265c00",
              "tlc_minimum_value": "0x1",
              "fee_rate": "0x3e8"
            }
          }
        ],
        "last_cursor": "0x"
      }
    },
    "list_payments": {
      "result": {
        "payments": [],
        "last_cursor": null
      }
    },
    "parse_invoice": {
      "result": {
        "invoice": {
          "currency": "Fibt",
          "amount": "0x186a0",
          "signature": "0xdemo",
          "data": {
            "timestamp": "4102444800",
            "payment_hash": "0x9999999999999999999999999999999999999999999999999999999999999999",
            "attrs": [
              {
                "expiry_time": "0x15180"
              },
              {
                "payee_public_key": "02dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd"
              },
              {
                "feature": ["basic_mpp"]
              }
            ]
          }
        }
      }
    },
    "send_payment": {
      "result": {
        "payment_hash": "0x9999999999999999999999999999999999999999999999999999999999999999",
        "status": "Created",
        "created_at": "0x1",
        "last_updated_at": "0x1",
        "failed_error": null,
        "fee": "0x64",
        "routers": [
          {
            "nodes": [
              {
                "pubkey": "02aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa",
                "amount": "0x18704",
                "channel_outpoint": "0xaaaa0001"
              },
              {
                "pubkey": "02bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
                "amount": "0x186a0",
                "channel_outpoint": "0xbbbb0001"
              },
              {
                "pubkey": "02dddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd",
                "amount": "0x186a0",
                "channel_outpoint": "0xbbbb0001"
              }
            ]
          }
        ]
      }
    }
  }
}
